ch01/soapRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ts="http://ts.ch01/">
   <soapenv:Header/>
   <soapenv:Body>
      <ts:getTimeAsElapsed/>
   </soapenv:Body>
</soapenv:Envelope>